; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-5-2)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	person1 - person
	person2 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	)
(:init
	(at plane1 city0)
	(= (capacity plane1) 8671)
	(= (fuel plane1) 2203)
	(= (slow-burn plane1) 3)
	(= (fast-burn plane1) 11)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 1)
	(at plane2 city0)
	(= (capacity plane2) 10608)
	(= (fuel plane2) 1349)
	(= (slow-burn plane2) 5)
	(= (fast-burn plane2) 15)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 3)
	(at plane3 city0)
	(= (capacity plane3) 5325)
	(= (fuel plane3) 1692)
	(= (slow-burn plane3) 2)
	(= (fast-burn plane3) 6)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 5)
	(at plane4 city1)
	(= (capacity plane4) 4453)
	(= (fuel plane4) 1359)
	(= (slow-burn plane4) 2)
	(= (fast-burn plane4) 6)
	(= (onboard plane4) 0)
	(= (zoom-limit plane4) 4)
	(at plane5 city0)
	(= (capacity plane5) 5913)
	(= (fuel plane5) 1147)
	(= (slow-burn plane5) 2)
	(= (fast-burn plane5) 7)
	(= (onboard plane5) 0)
	(= (zoom-limit plane5) 4)
	(at person1 city8)
	(at person2 city4)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 972)
	(= (distance city0 city2) 938)
	(= (distance city0 city3) 931)
	(= (distance city0 city4) 696)
	(= (distance city0 city5) 955)
	(= (distance city0 city6) 747)
	(= (distance city0 city7) 659)
	(= (distance city0 city8) 625)
	(= (distance city1 city0) 972)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 633)
	(= (distance city1 city3) 872)
	(= (distance city1 city4) 669)
	(= (distance city1 city5) 721)
	(= (distance city1 city6) 575)
	(= (distance city1 city7) 733)
	(= (distance city1 city8) 622)
	(= (distance city2 city0) 938)
	(= (distance city2 city1) 633)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 551)
	(= (distance city2 city4) 893)
	(= (distance city2 city5) 636)
	(= (distance city2 city6) 985)
	(= (distance city2 city7) 957)
	(= (distance city2 city8) 969)
	(= (distance city3 city0) 931)
	(= (distance city3 city1) 872)
	(= (distance city3 city2) 551)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 531)
	(= (distance city3 city5) 673)
	(= (distance city3 city6) 624)
	(= (distance city3 city7) 617)
	(= (distance city3 city8) 964)
	(= (distance city4 city0) 696)
	(= (distance city4 city1) 669)
	(= (distance city4 city2) 893)
	(= (distance city4 city3) 531)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 669)
	(= (distance city4 city6) 891)
	(= (distance city4 city7) 666)
	(= (distance city4 city8) 707)
	(= (distance city5 city0) 955)
	(= (distance city5 city1) 721)
	(= (distance city5 city2) 636)
	(= (distance city5 city3) 673)
	(= (distance city5 city4) 669)
	(= (distance city5 city5) 0)
	(= (distance city5 city6) 872)
	(= (distance city5 city7) 639)
	(= (distance city5 city8) 645)
	(= (distance city6 city0) 747)
	(= (distance city6 city1) 575)
	(= (distance city6 city2) 985)
	(= (distance city6 city3) 624)
	(= (distance city6 city4) 891)
	(= (distance city6 city5) 872)
	(= (distance city6 city6) 0)
	(= (distance city6 city7) 804)
	(= (distance city6 city8) 835)
	(= (distance city7 city0) 659)
	(= (distance city7 city1) 733)
	(= (distance city7 city2) 957)
	(= (distance city7 city3) 617)
	(= (distance city7 city4) 666)
	(= (distance city7 city5) 639)
	(= (distance city7 city6) 804)
	(= (distance city7 city7) 0)
	(= (distance city7 city8) 600)
	(= (distance city8 city0) 625)
	(= (distance city8 city1) 622)
	(= (distance city8 city2) 969)
	(= (distance city8 city3) 964)
	(= (distance city8 city4) 707)
	(= (distance city8 city5) 645)
	(= (distance city8 city6) 835)
	(= (distance city8 city7) 600)
	(= (distance city8 city8) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane1 city8)
	(at plane2 city2)
	(at person1 city1)
	(at person2 city5)
	))

(:metric minimize (+ (* 1 (total-time))  (* 2 (total-fuel-used))))
)

; plan
1. (refuel plane2 city0)
   changed: (fuel plane2) from 1349 to 10608
   goals met: 0 of 4
2. (fly plane2 city0 city4)
   deleted: (at plane2 city0)
   added: (at plane2 city4)
   changed: (total-fuel-used) from 0 to 3480, (fuel plane2) from 10608 to 7128
   goals met: 0 of 4
3. (board person2 plane2 city4)
   deleted: (at person2 city4)
   added: (in person2 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 0 of 4
4. (fly plane1 city0 city8)
   deleted: (at plane1 city0)
   added: (at plane1 city8)
   changed: (total-fuel-used) from 3480 to 5355, (fuel plane1) from 2203 to 328
   goals met: 1 of 4
5. (refuel plane1 city8)
   changed: (fuel plane1) from 328 to 8671
   goals met: 1 of 4
6. (board person1 plane1 city8)
   deleted: (at person1 city8)
   added: (in person1 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 1 of 4
7. (fly plane2 city4 city5)
   deleted: (at plane2 city4)
   added: (at plane2 city5)
   changed: (total-fuel-used) from 5355 to 8700, (fuel plane2) from 7128 to 3783
   goals met: 1 of 4
8. (debark person2 plane2 city5)
   deleted: (in person2 plane2)
   added: (at person2 city5)
   changed: (onboard plane2) from 1 to 0
   goals met: 2 of 4
9. (fly plane2 city5 city2)
   deleted: (at plane2 city5)
   added: (at plane2 city2)
   changed: (total-fuel-used) from 8700 to 11880, (fuel plane2) from 3783 to 603
   goals met: 3 of 4
10. (fly plane1 city8 city1)
   deleted: (at plane1 city8)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 11880 to 13746, (fuel plane1) from 8671 to 6805
   goals met: 2 of 4
11. (debark person1 plane1 city1)
   deleted: (in person1 plane1)
   added: (at person1 city1)
   changed: (onboard plane1) from 1 to 0
   goals met: 3 of 4
12. (fly plane1 city1 city8)
   deleted: (at plane1 city1)
   added: (at plane1 city8)
   changed: (total-fuel-used) from 13746 to 15612, (fuel plane1) from 6805 to 4939
   goals met: 4 of 4
